/**
 * Created by serhiy on 2/15/17.
 */
public class ArrayApp {
    public static void main(String[] args) {

// array.java
// Робота з масивами Java

////////////////////////////////////////////////////////////////
                        long[] arr;
// Посилання на масив
                arr = new long[100];
// Створення масиву
                int nElems = 0;
// Кількість елементів
                int j;
// Лічильник циклу
                long searchKey;
// Ключі шуканого елементу
//--------------------------------------------------------------
                arr[0] = 77;
// Вставка 10 елементів
                arr[1] = 99;
                arr[2] = 44;
                arr[3] = 55;
                arr[4] = 22;
                arr[5] = 88;
                arr[6] = 11;
                arr[7] = 00;
                arr[8] = 66;
                arr[9] = 33;
                nElems = 10;
// Масив містить 10 елементів
//--------------------------------------------------------------
                for(j=0; j<nElems; j++)
// Вивід елементів
                    System.out.print(arr[j] + " ");
                System.out.println("");
//--------------------------------------------------------------
                searchKey = 66;
// Пошук елемента з ключем 66
                for(j=0; j<nElems; j++)
// Для кожного елементу
                    if(arr[j] == searchKey)
// Значення знайдено?
                        break;
// Да - вихід з циклу
                if(j == nElems)
// Досягнуто останній елемент?
                    System.out.println("Can't find " + searchKey); // Да
                else
                    System.out.println("Found " + searchKey);
// Ні
//--------------------------------------------------------------
                searchKey = 55;
// Видалення елементу з ключем 55
                for(j=0; j<nElems; j++)
// Пошук елементу, який має бути видалений
                    if(arr[j] == searchKey)
                        break;
                for(int k=j; k<nElems-1; k++)
// Зсув останніх елементів
                    arr[k] = arr[k+1];
                nElems--;
// Зменшення розміру
//--------------------------------------------------------------
                for(j=0; j<nElems; j++)
// Вивід елементів
                    System.out.print( arr[j] + " ");
                System.out.println("");
            }
        } // Клас ArrayApp



